---
kind: type
id: T:Autodesk.Revit.ApplicationServices.ControlledApplication
source: html/35859972-2407-3910-cb07-bbb337e307e6.htm
---
# Autodesk.Revit.ApplicationServices.ControlledApplication

Represents the Autodesk Revit Application with no access to documents. It provides options
and other application wide data and settings for external applications OnStartup/OnShutdown.

## Syntax (C#)
```csharp
public class ControlledApplication
```